# Spencer Chun

In [2]:
data_dict = {'soda':['coke', 'diet coke', 'sprite', 'pepsi', 'mug', 'mt. dew'],
              'cals':[140, 1, 90, 150, 130, 170],
              'sodium':[45, 40, 65, 30, 65, 60],
              'corp': ['coca cola', 'coca cola', 'coca cola', 'pepsico', 'pepsico', 'pepsico']}

In [3]:
import pandas as pd
sodas = pd.DataFrame(data_dict)

In [3]:
sodas.set_index('soda', inplace = True)

In [4]:
sodas[sodas['cals']>100]

         cals  sodium       corp
soda
coke      140      45  coca cola
pepsi     150      30    pepsico
mug       130      65    pepsico
mt. dew   170      60    pepsico

In [5]:
sodas.loc[['coke', 'pepsi', 'mug']]

       cals  sodium       corp
soda
coke    140      45  coca cola
pepsi   150      30    pepsico
mug     130      65    pepsico

In [6]:
sodas.loc['coke']['cals']

140

In [4]:
banking_data = pd.read_csv("https://users.ssc.wisc.edu/~mckelvey/ec390/banks_and_branches.csv", header = 6)

In [8]:
[i.lower() for i in banking_data.columns]

['year', 'institutions', 'branches', 'offices']

In [9]:
banking_data.drop('Branches', axis = 'columns', inplace = True)

In [10]:
banking_data.rename(columns = {'Institutions':'Banks'}, inplace = True)

In [11]:
banking_data.set_index('Year', inplace = True)

In [12]:
display(banking_data)

       Banks Offices
Year
2017   4,918  84,081
2016   5,112  85,201
2015   5,340  86,881
2014   5,607  87,597
2013   5,847  88,582
...      ...     ...
1938  13,661  17,073
1937  13,797  17,178
1936  13,973  17,234
1935  14,125  17,237
1934  14,146  14,146

[84 rows x 2 columns]

In [13]:
display(banking_data.dtypes)

Banks      object
Offices    object
dtype: object

In [14]:
banking_data.to_csv('banking_data.csv', index = False)